package org.example.coffee;

public class Arabica extends Coffee {

  public Arabica(String name, int countCaffeine, COFFEE_TYPE coffeeType, int price, int weight) {
    super(name, countCaffeine, coffeeType, price, weight);
  }

  @Override
  public void howToMake() {
    System.out.println(
        "По-перше, візьміть правильну турку – з вузьким горлечком і з міді, "
            + "вона володіє кращою теплопровідністю, що ідеально для приготування арабіки. "
            + "По-друге, не забудьте обполоснути турку окропом, щоб прогріти її, а потім всипте "
            + "2 чайних ложки кави на 100 мл води. Якщо ви віддаєте перевагу солодку каву, то можна "
            + "відразу всипати цукор. Далі влийте в турку воду так, щоб вона доходила до самого"
            + " вузького місця. Постарайтеся акуратно влити воду, щоб крупинки кави не піднялися вгору.\n"
            + "\n"
            + "Поставте турку на плиту і уважно стежте за кавою. "
            + "Коли зверху почне підніматися пінка, зменшіть вогонь і "
            + "вимкніть його зовсім в той момент, коли кава ось-ось закипить. "
            + "Важливо не дати йому закипіти і зняти прямо перед цим моментом. "
            + "Для цього потрібна певна вправність, але варто попрактикуватися, "
            + "і ви будете по звуках і виду кави відчувати правильний момент");
  }
}
